app/controllers/students_controller.rb

  def create
    @student = Student.new(post_params)
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2018-10-18 20:32:36.905305"], ["updated_at", "2018-10-18 20:32:36.905305"]]

  def update
    @student = Student.find(params[:id])
    @student.update(post_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-10-18 20:37:44.639602"], ["id", 1]]